docs: router cost function mermaid (#4943)
Signed-off-by: PeaBrane <yanrpei@gmail.com>
